Repository: chronm/blackout
Catalog: lib/l10n/intl_*.arb
Languages: de

source: Batches
de: Chargen

# CHANGE_ADDED
source: added {amount} {date}
de: {date} {amount} hinzugefügt

source: Changes
de: Änderungen

# CHANGE_TOOK
source: Took {amount} {date}
de: {date} {amount} entnommen

# DIALOG_ACCEPT_BUTTON
source: Accept
de: Annehmen

# DIALOG_ADD_TO_BATCH
source: Add tobatch
de: Zur Charge hinzufügen

# DIALOG_CANCEL_BUTTON
source: Cancel
de: Abbrechen

# DIALOG_TAKE_FROM_BATCH
source: Take frombatch
de: Von Charge entnehmen

# GENERAL_AMOUNT_AVAILABLE
source: Available: {amount}
de: Verfügbar: {amount}

# GENERAL_DAYS
source: {days, plural, zero{} one{1 day} other{{days} days}}
de: {days, plural, zero{} one{1 Tag} other{{days} Tage}}

# GENERAL_DELETE
source: Delete
de: Löschen

# GENERAL_DELETE_CONFIRMATION
source: Really delete?
de: Wirklich löschen?

# GENERAL_DELETE_CONFIRMATION_NO
source: No
de: Nein

# GENERAL_DELETE_CONFIRMATION_YES
source: Yes
de: Ja

# GENERAL_EVENT_IN_MONTHS
source: {months, plural, zero{} one{in 1 month} other{in {months} months}}
de: {months, plural, zero{} one{in 1 Monat} other{in {months} Monaten}}

# GENERAL_EVENT_IN_OVER_A_YEAR
source: in over one year
de: in über einem Jahr

# GENERAL_EVENT_IN_WEEKS
source: {weeks, plural, zero{} one{in 1 week} other{in {weeks} weeks}}
de: {weeks, plural, zero{} one{in 1 Woche} other{in {weeks} Wochen}}

# GENERAL_EVENT_OVER_A_YEAR_AGO
source: over one year ago
de: vor über einem Jahr

# GENERAL_EVENT_TODAY
source: today
de: heute

# GENERAL_EVENT_TOMORROW
source: tomorrow
de: morgen

# GENERAL_EVENT_YESTERDAY
source: yesterday
de: gestern

# GENERAL_EXPIRED_AGO
source: expired {expirationDate}
de: lief {expirationDate} ab

# GENERAL_EXPIRES_AT
source: Expires at {expirationDate}
de: läuft {expirationDate} ab

# GENERAL_EXPIRES_IN
source: expires {interval}
de: läuft {interval} ab

# GENERAL_HOURS
source: {hours, plural, zero{} one{1 hour} other{{hours} hours}}
de: {hours, plural, zero{} one{1 Stunde} other{{hours} Stunden}}

# GENERAL_LESS_THAN_AVAILABLE
source: Less than {amount} available
de: Weniger als {amount} verfügbar

# GENERAL_MINUTES
source: {minutes, plural, zero{} one{1 minute} other{{minutes} minutes}}
de: {minutes, plural, zero{} one{1 Minute} other{{minutes} Minuten}}

# GENERAL_MONTHS
source: {months, plural, zero{} one{1 month} other{{months} months}}
de: {months, plural, zero{} one{1 Monat} other{{months} Monate}}

# GENERAL_NOTHING_HERE
source: Nothing here
de: Hier gibt's noch nichts

# GENERAL_NOTIFY_AT
source: Notify at {notificationDate}
de: Benachrichtige {notificationDate}

# GENERAL_SAVE
source: Save
de: Speichern

# GENERAL_SEARCH
source: Search ...
de: Suche ...

# GENERAL_SECONDS
source: {seconds, plural, zero{} one{1 second} other{{seconds} seconds}}
de: {seconds, plural, zero{} one{1 Sekunde} other{{seconds} Sekunden}}

# GENERAL_UNIT
source: Unit
de: Einheit

# GENERAL_WARN_INTERVAL
source: Warn period
de: Warnzeitraum

# GENERAL_WARN_INTERVAL_HELP
source: If abatch has an expiration date, Blackout will notify you of this period in advance. Example: "P1Y2M3W4D" corresponds to 1 year, 2 months, 3 weeks and 4 days
de: Wenn eine Charge ein Mindesthaltbarkeitsdatum besitzt wird Blackout dich diesen Zeitraum vorher benachrichtigen. Beispiel: "P1Y2M3W4D" entspricht 1 Jahr, 2 Monaten, 3 Wochen und 4 Tagen

# GENERAL_WEEKS
source: {weeks, plural, zero{} one{1 week} other{{weeks} weeks}}
de: {weeks, plural, zero{} one{1 Woche} other{{weeks} Wochen}}

# GENERAL_YEARS
source: {years, plural, zero{} one{1 year} other{{years} years}}
de: {years, plural, zero{} one{1 Jahr} other{{years} Jahre}}

# GROUP_MINIMUM_AMOUNT
source: Minimum amount
de: Mindestmenge

# GROUP_NAME
source: Name of this group
de: Name der Kategorie

# GROUP_PLURAL_NAME
source: Plural form of name
de: Pluralform des Names

# GROUP_PLURAL_NAME_INFO
source: Will be used when amount is zero or greater than one.
de: Wird verwendet, wenn die Menge 0 oder größer als 1 ist.

# HOME_PRODUCTS_AND_GROUPS
source: Products and Groups
de: Produkte und Gruppen

# MAIN_IMPORT_DATABASE_DESCRIPTION
source: If you want me to import it, please enter the password for the database. You can also ignore the backup, but then it will be permanently deleted.
de: Wenn ich es importieren soll, gib bitte das Passwort für die Datenbank ein. Du kannst das Backup auch ignorieren, dann wird es jedoch endgültig gelöscht.

# MAIN_IMPORT_DATABASE_ERROR
source: Your password was wrong.
de: Das Passwort war falsch.

# MAIN_IMPORT_DATABASE_IGNORE
source: Ignore
de: Ignorieren

# MAIN_IMPORT_DATABASE_IMPORT
source: Import
de: Importieren

# MAIN_IMPORT_DATABASE_TITLE
source: I found a backup.
de: Ich hab ein Backup gefunden.

# MODEL_CHANGE_CREATED
source: Created
de: Erstellt

# MODEL_CHANGE_FIELD_DISABLED
source: Disabled {field} ({from})
de: {field} ({from}) deaktiviert

# MODEL_CHANGE_FIELD_ENABLED
source: Enabled {field} ({to})
de: {field} ({to}) aktiviert

# MODEL_CHANGE_FIELD_MODIFIED
source: Changed {field} from {from} to {to}
de: Änderung von {field} von {from} zu {to}

source: No products
de: Keine Produkte

# PERMISSIONS_STORAGE_PERMANENTLY_BODY
source: Unfortunately you have permanently taken away my access to the memory, but I need it for the database. But I can redirect you to the settings where I can regain access.
de: Leider hast du mir dauerhaft den Zugriff auf den Speicher entzogen, den brauche ich jedoch für die Datenbank. Ich kann dich aber zu den Einstellungen weiterleiten, wo mir den Zugriff wieder erlauben kannst.

# PERMISSIONS_STORAGE_PERMANENTLY_NOPE
source: No!
de: Nein!

# PERMISSIONS_STORAGE_PERMANENTLY_TITLE
source: Access to storage
de: Zugriff auf Speicher

# PERMISSIONS_STORAGE_RATIONALE_BODY
source: I need access to the memory for the database, without it Blackout can unfortunately not work
de: Ich brauche den Zugriff auf den Speicher für die Datenbank, ohne kann Blackout leider nicht funktionieren

# PERMISSIONS_STORAGE_RATIONALE_TITLE
source: Access to storage
de: Zugriff auf Speicher

# PRODUCT_DESCRIPTION
source: Description
de: Beschreibung

# PRODUCT_EAN
source: Product code
de: Produktcode

source: Products
de: Produkte

# SETTINGS_TITLE
source: Settings
de: Einstellungen

# SETTINGS_USERNAME
source: Username
de: Benutzername

# SETUP_STEP_CREATE_HOME_DESCRIPTION
source: What would you like to call your household? Choose wisely, you cannot change it.
de: Wie möchten du deinen Haushalt nennen? Wähle weise, du kannst ihn nicht ändern.

# SETUP_STEP_CREATE_HOME_TITLE
source: Household
de: Haushalt

# SETUP_STEP_CREATE_PASSWORD_DESCRIPTION
source: Please enter a password that will be used to encrypt your local database.
de: Bitte gib ein Passwort an, welches für die Verschlüsselung der Datanbank genutzt wird.

# SETUP_STEP_CREATE_PASSWORD_ERROR
source: Password must not be empty.
de: Passwort darf nicht leer sein.

# SETUP_STEP_CREATE_PASSWORD_HELP
source: Password is insecure.
de: Passwort ist unsicher.

# SETUP_STEP_CREATE_PASSWORD_HINT_DESCRIPTION
source: Your password should have at least 16 characters and contain the following characters: - upper and lower case letters - numbers - special characters
de: Dein Passwort sollte mindestens 16 Stellen besitzen und die folgenden Zeichen enthalten: - Groß- und Kleinbuchstaben - Ziffern - Sonderzeichen

# SETUP_STEP_CREATE_PASSWORD_HINT_TITLE
source: Password guidelines
de: Passwortrichtlinien

# SETUP_STEP_CREATE_PASSWORD_TITLE
source: Password
de: Passwort

# SETUP_STEP_CREATE_USERNAME_DESCRIPTION
source: To track your actions, I need a username from you. If you do not like it later, you can change it.
de: Um deine Aktionen nachzuverfolgen, brauche einen Benutzernamen von dir. Wenn er dir später nicht gefällt, kannst du ihn auch noch ändern.

# SETUP_STEP_CREATE_USERNAME_TITLE
source: Username
de: Benutzername

# SETUP_STEP_FINISH_DESCRIPTION
source: If you are satisfied, you can complete the setup now.
de: Wenn du zufrieden bist, kannst du die Einrichtung jetzt abschließen.

# SETUP_STEP_FINISH_DESCRIPTION_ERROR
source: Please look again at the previous steps.
de: Bitte schau dir nochmal die vorherigen Schritte an.

# SETUP_STEP_FINISH_SEND
source: Send
de: Abschicken

# SETUP_STEP_FINISH_TITLE
source: Finish
de: Fertig

# SETUP_STEP_INTRODUCTION_DESCRIPTION
source: Welcome to Blackout. We'll just set up the app, then you'll be good to go.
de: Willkommen bei Blackout. Wir richten eben die App ein, dann kann es auch schon losgehen.

# SETUP_STEP_INTRODUCTION_TITLE
source: Introduction
de: Einleitung

# SPEEDDIAL_ADD_TO_BATCH
source: Add
de: Hinzufügen

# SPEEDDIAL_CREATE_BATCH
source: Create batch
de: Charge erstellen

# SPEEDDIAL_CREATE_GROUP
source: Create group
de: Gruppe erstellen

# SPEEDDIAL_CREATE_PRODUCT
source: Create product
de: Produkt erstellen

# SPEEDDIAL_GOTO_HOME
source: Home
de: Start

# SPEEDDIAL_SCAN
source: Scan barcode
de: Barcode scannen

# SPEEDDIAL_TAKE_FROM_BATCH
source: Take
de: Entnehmen

# UNITENUM_VOLUME
source: Volume
de: Volumen

# UNITENUM_WEIGHT
source: Weight
de: Gewicht

# WARN_AMOUNT_COULD_NOT_BE_PARSED
source: {amount} is not valid
de: {amount} ist kein gültiger Wert

# WARN_DESCRIPTION_MUST_NOT_BE_EMPTY
source: Description must not be empty
de: Beschreibung darf nicht leer sein

# WARN_EAN_MUST_NOT_BE_EMPTY
source: Product code must not be empty
de: Produktcode darf nicht leer sein

# WARN_EXPIRATION_DATE_COULD_NOT_BE_PARSED
source: {expirationDate} is not a valid date
de: {expirationDate} ist kein gültiges Datum

# WARN_NAME_MUST_NOT_BE_EMPTY
source: Name must not be empty
de: Name darf nicht leer sein

# WARN_NOTIFICATION_DATE_COULD_NOT_BE_PARSED
source: {notificationDate} is not valid
de: {notificationDate} ist kein gültiger Wert

# WARN_PERIOD_COULD_NOT_BE_PARSED
source: {period} is not a valid time span
de: {period} ist kein gültiger Zeitraum

# WARN_PERIOD_MUST_NOT_BE_EMPTY
source: Period must not be empty
de: Zeitraum darf nicht leer sein

# WARN_PLURAL_NAME_MUST_NOT_BE_EMPTY
source: Plural form must not be empty
de: Pluralform darf nicht leer sein

# WARN_REFILL_LIMIT_MUST_NOT_BE_EMPTY
source: Refill limit must not be empty
de: Mindestmenge darf nicht leer sein

# WARN_USERNAME_MUST_NOT_BE_EMPTY
source: Username must not be empty
de: Benutzername darf nicht leer sein
